{
    "en": {
        "title": "Eurojackpot – Today's Lucky Numbers (Statistics)",
        "subtitle": "AI-powered statistical popular numbers of the day, continuously updated for professional insights.",
        "cardTitle": "AI Statistics Suggested Numbers",
        "generateDescription": "Our advanced AI analyzes historical draws, weather patterns, and daily conditions to provide continuously updated, statistically-backed Eurojackpot number suggestions for today.",
        "generateStatisticalButton": "Generate AI Statistical Numbers",
        "resultTitle": "Your Lucky Numbers",
        "resultSubtitle": "Here are your generated numbers.",
        "backButton": "Back to Generator",
        "howItWorksTitle": "How It Works",
        "step1": "Analyze Historical Draws & Conditions",
        "step2": "AI Algorithm Suggests Numbers",
        "step3": "See Your Statistically Optimized Numbers!",
        "navHome": "Home",
        "navGenerator": "Generator",
        "navBlog": "Blog",
        "navInfo": "Information",
        "navAbout": "About Us",
        "navContact": "Contact",
        "welcomeTitle": "Welcome to Eurojackpot Pro",
        "welcomeText": "Your one-stop destination for everything related to the Eurojackpot lottery. Whether you're looking for the latest results, a tool to generate your lucky numbers, or in-depth articles about lottery strategies, we have you covered.",
        "featuredTitle": "Featured Articles",
        "post1Title": "Understanding the Odds: A Deep Dive",
        "post1Summary": "Ever wondered what your actual chances of winning the Eurojackpot are? In this article, we break down the mathematics behind the odds in a simple, easy-to-understand way.",
        "readMore": "Read More",
        "aboutTitle": "About Eurojackpot Pro - AI Statistics",
        "aboutText1": "Welcome to Eurojackpot Pro, your cutting-edge source for Eurojackpot number insights. We harness advanced AI and comprehensive historical data to bring you statistically suggested numbers, enhancing your lottery experience with informed choices.",
        "aboutText2": "Established in 2026, Eurojackpot Pro has evolved from a passion for data-driven analytics into a sophisticated platform for lottery enthusiasts. Our methodology continuously adapts, processing vast datasets including past draws, weather patterns, and environmental factors to refine our suggestions. We're dedicated to empowering players across Europe with innovative, data-backed insights.",
        "aboutText3": "We hope you enjoy our products as much as we enjoy offering them to you. If you have any questions or comments, please don't hesitate to contact us.",
        "contactTitle": "Contact Us",
        "contactText": "Have a question or feedback? Fill out the form below and we'll get back to you as soon as possible.",
        "navPrivacy": "Privacy Policy",
        "navTerms": "Terms of Service",
        "formName": "Name",
        "formEmail": "Email",
        "formMessage": "Message",
        "formSubmit": "Send Message",
        "blogTitle": "Lottery Blog",
        "post1Intro": "The dream of winning the lottery is universal, but what are the actual mathematical odds of hitting the Eurojackpot jackpot? In this article, we'll explore the numbers behind the game to give you a clearer picture of your chances.",
        "post1Subtitle1": "The Basics of Combinations",
        "post1Text1": "To understand lottery odds, we first need to understand the concept of combinations. In mathematics, a combination is a selection of items from a collection, such that the order of selection does not matter. For Eurojackpot, you choose 5 numbers from 50, and 2 numbers from 12. These are two separate combination calculations.",
        "post1Subtitle2": "Calculating the Odds",
        "post1Text2": "The formula for combinations is nCr = n! / (r! * (n-r)!), where n is the total number of items to choose from, and r is the number of items to choose.",
        "post1Text3": "For the main numbers: n=50, r=5. So, 50! / (5! * 45!) = 2,118,760.",
        "post1Text4": "For the Euro numbers: n=12, r=2. So, 12! / (2! * 10!) = 66.",
        "post1Text5": "To get the total odds of winning the jackpot, you multiply the odds of both sets of numbers: 2,118,760 * 66 = 139,838,160. So, the odds of winning the Eurojackpot jackpot are approximately 1 in 140 million.",
        "post1Subtitle3": "What Does This Mean?",
        "post1Text6": "While the odds are steep, it's important to remember that lotteries are a game of chance. Every ticket has an equal opportunity to win. The key is to play for fun and within your means. Good luck!",
        "navTitle": "Navigation",
        "footer": "&copy; 2026 Eurojackpot Pro. All Rights Reserved.",
        "footerDisclaimer": "Please play responsibly. You must be 18 or older to play."
    },
    "de": {
        "title": "Eurojackpot – Heutige Glückszahlen (Statistik)",
        "subtitle": "KI-gestützte statistische Trendzahlen des Tages, kontinuierlich aktualisiert für professionelle Einblicke.",
        "cardTitle": "KI-Statistik Vorgeschlagene Zahlen",
        "generateDescription": "Unsere fortschrittliche KI analysiert historische Ziehungen, Wettermuster und tägliche Bedingungen, um kontinuierlich aktualisierte, statistisch fundierte Eurojackpot-Zahlenvorschläge für heute zu liefern.",
        "generateStatisticalButton": "KI-Statistische Zahlen generieren",
        "resultTitle": "Ihre Glückszahlen",
        "resultSubtitle": "Hier sind Ihre generierten Zahlen.",
        "backButton": "Zurück zum Generator",
        "howItWorksTitle": "So funktioniert's",
        "step1": "Historische Ziehungen & Bedingungen analysieren",
        "step2": "KI-Algorithmus schlägt Zahlen vor",
        "step3": "Sehen Sie Ihre statistisch optimierten Zahlen!",
        "navHome": "Startseite",
        "navGenerator": "Generator",
        "navBlog": "Blog",
        "navInfo": "Informationen",
        "navAbout": "Über uns",
        "navContact": "Kontakt",
        "welcomeTitle": "Willkommen bei Eurojackpot Pro",
        "welcomeText": "Ihr One-Stop-Ziel für alles rund um die Eurojackpot Lotterie. Egal, ob Sie die neuesten Ergebnisse, ein Tool zur Generierung Ihrer Glückszahlen oder ausführliche Artikel über Lotteriestrategien suchen, bei uns sind Sie richtig.",
        "featuredTitle": "Ausgewählte Artikel",
        "post1Title": "Die Chancen verstehen: Ein tiefer Einblick",
        "post1Summary": "Haben Sie sich jemals gefragt, wie hoch Ihre tatsächlichen Gewinnchancen beim Eurojackpot sind? In diesem Artikel schlüsseln wir die Mathematik hinter den Quoten einfach und verständlich auf.",
        "readMore": "Mehr lesen",
        "aboutTitle": "Über Eurojackpot Pro - KI-Statistiken",
        "aboutText1": "Willkommen bei Eurojackpot Pro, Ihrer hochmodernen Quelle für Einblicke in Eurojackpot-Zahlen. Wir nutzen fortschrittliche KI und umfassende historische Daten, um Ihnen statistisch vorgeschlagene Zahlen zu liefern und Ihr Lotterieerlebnis mit fundierten Entscheidungen zu bereichern.",
        "aboutText2": "Gegründet im Jahr 2026, hat sich Eurojackpot Pro von einer Leidenschaft für datengesteuerte Analysen zu einer hochentwickelten Plattform für Lotterie-Enthusiasten entwickelt. Unsere Methodik passt sich kontinuierlich an und verarbeitet riesige Datensätze, einschließlich vergangener Ziehungen, Wettermuster und Umweltfaktoren, um unsere Vorschläge zu verfeinern. Wir engagieren uns dafür, Spielern in ganz Europa innovative, datengestützte Einblicke zu ermöglichen.",
        "aboutText3": "Wir hoffen, dass Ihnen unsere Produkte genauso gut gefallen, wie wir es genießen, sie Ihnen anzubieten. Wenn Sie Fragen oder Kommentare haben, zögern Sie bitte nicht, uns zu kontaktieren.",
        "contactTitle": "Kontaktieren Sie uns",
        "contactText": "Haben Sie eine Frage oder Feedback? Füllen Sie das untenstehende Formular aus und wir werden uns so schnell wie möglich bei Ihnen melden.",
        "navPrivacy": "Datenschutzerklärung",
        "navTerms": "Nutzungsbedingungen",
        "formName": "Name",
        "formEmail": "E-Mail",
        "formMessage": "Nachricht",
        "formSubmit": "Nachricht senden",
        "blogTitle": "Lotterie-Blog",
        "post1Intro": "Der Traum vom Lotteriegewinn ist universell, aber wie hoch sind die tatsächlichen mathematischen Gewinnchancen beim Eurojackpot-Jackpot? In diesem Artikel werden wir die Zahlen hinter dem Spiel untersuchen, um Ihnen ein klareres Bild Ihrer Chancen zu geben.",
        "post1Subtitle1": "Die Grundlagen der Kombinationen",
        "post1Text1": "Um Lotterie-Quoten zu verstehen, müssen wir zuerst das Konzept der Kombinationen verstehen. In der Mathematik ist eine Kombination eine Auswahl von Elementen aus einer Sammlung, bei der die Reihenfolge der Auswahl keine Rolle spielt. Für Eurojackpot wählen Sie 5 Zahlen aus 50 und 2 Zahlen aus 12. Dies sind zwei separate Kombinationsberechnungen.",
        "post1Subtitle2": "Berechnung der Quoten",
        "post1Text2": "Die Formel für Kombinationen lautet nCr = n! / (r! * (n-r)!), wobei n die Gesamtzahl der auszuwählenden Elemente und r die Anzahl der auszuwählenden Elemente ist.",
        "post1Text3": "Für die Hauptzahlen: n=50, r=5. Also, 50! / (5! * 45!) = 2.118.760.",
        "post1Text4": "Für die Eurozahlen: n=12, r=2. Also, 12! / (2! * 10!) = 66.",
        "post1Text5": "Um die Gesamtquoten für den Gewinn des Jackpots zu erhalten, multiplizieren Sie die Quoten beider Zahlensätze: 2.118.760 * 66 = 139.838.160. Die Wahrscheinlichkeit, den Eurojackpot-Jackpot zu gewinnen, liegt also bei etwa 1 zu 140 Millionen.",
        "post1Subtitle3": "Was bedeutet das?",
        "post1Text6": "Obwohl die Quoten hoch sind, ist es wichtig zu bedenken, dass Lotterien ein Glücksspiel sind. Jedes Ticket hat die gleiche Gewinnchance. Der Schlüssel ist, zum Spaß und im Rahmen Ihrer Möglichkeiten zu spielen. Viel Glück!",
        "navTitle": "Navigation",
        "footer": "&copy; 2026 Eurojackpot Pro. Alle Rechte vorbehalten.",
        "footerDisclaimer": "Bitte spielen Sie verantwortungsbewusst. Sie müssen 18 Jahre oder älter sein, um spielen zu dürfen."
    },
    "es": {
        "title": "Eurojackpot – Números de la Suerte de Hoy (Estadísticas)",
        "subtitle": "Números populares estadísticos del día impulsados por IA, actualizados continuamente para obtener información profesional.",
        "cardTitle": "Números Sugeridos por Estadísticas de IA",
        "generateDescription": "Nuestra IA avanzada analiza sorteos históricos, patrones climáticos y condiciones diarias para proporcionar sugerencias de números de Eurojackpot respaldadas estadísticamente y actualizadas continuamente para hoy.",
        "generateStatisticalButton": "Generar Números Estadísticos de IA",
        "resultTitle": "Sus números de la suerte",
        "resultSubtitle": "Aquí están sus números generados.",
        "backButton": "Volver al generador",
        "howItWorksTitle": "Cómo funciona",
        "step1": "Analizar sorteos históricos y condiciones",
        "step2": "Algoritmo de IA sugiere números",
        "step3": "¡Vea sus números estadísticamente optimizados!",
        "navHome": "Inicio",
        "navGenerator": "Generador",
        "navBlog": "Blog",
        "navInfo": "Información",
        "navAbout": "Acerca de nosotros",
        "navContact": "Contacto",
        "welcomeTitle": "Bienvenido a Eurojackpot Pro",
        "welcomeText": "Su destino único para todo lo relacionado con la lotería Eurojackpot. Ya sea que esté buscando los últimos resultados, una herramienta para generar sus números de la suerte o artículos detallados sobre estrategias de lotería, lo tenemos cubierto.",
        "featuredTitle": "Artículos destacados",
        "post1Title": "Entendiendo las probabilidades: Una inmersión profunda",
        "post1Summary": "¿Alguna vez se preguntó cuáles son sus posibilidades reales de ganar el Eurojackpot? En este artículo, desglosamos las matemáticas detrás de las probabilidades de una manera simple y fácil de entender.",
        "readMore": "Leer más",
        "aboutTitle": "Acerca de Eurojackpot Pro - Estadísticas de IA",
        "aboutText1": "Bienvenido a Eurojackpot Pro, su fuente de vanguardia para obtener información sobre los números de Eurojackpot. Aprovechamos la IA avanzada y datos históricos completos para ofrecerle números sugeridos estadísticamente, mejorando su experiencia en la lotería con elecciones informadas.",
        "aboutText2": "Establecido en 2026, Eurojackpot Pro ha evolucionado de una pasión por el análisis basado en datos a una plataforma sofisticada para entusiastas de la lotería. Nuestra metodología se adapta continuamente, procesando vastos conjuntos de datos que incluyen sorteos anteriores, patrones climáticos y factores ambientales para refinar nuestras sugerencias. Nos dedicamos a capacitar a los jugadores de toda Europa con conocimientos innovadores y respaldados por datos.",
        "aboutText3": "Esperamos que disfrute de nuestros productos tanto como nosotros disfrutamos ofreciéndoselos. Si tiene alguna pregunta o comentario, no dude en contactarnos.",
        "contactTitle": "Contáctenos",
        "contactText": "Tiene una pregunta o comentario? Rellene el siguiente formulario y nos pondremos en contacto con usted lo antes posible.",
        "navPrivacy": "Política de Privacidad",
        "navTerms": "Términos de Servicio",
        "formName": "Nombre",
        "formEmail": "Correo electrónico",
        "formMessage": "Mensaje",
        "formSubmit": "Enviar mensaje",
        "blogTitle": "Blog de lotería",
        "post1Intro": "El sueño de ganar la lotería es universal, pero ¿cuáles son las probabilidades matemáticas reales de ganar el premio gordo del Eurojackpot? En este artículo, exploraremos los números behind the game to give you a clearer picture of your chances.",
        "post1Subtitle1": "Los fundamentos de las combinaciones",
        "post1Text1": "Para entender las probabilidades de la lotería, primero necesitamos entender el concepto de combinaciones. En matemáticas, una combinación es una selección de elementos de una colección, de tal manera que el orden de selección no importa. Para Eurojackpot, usted elige 5 números de 50 y 2 números de 12. Estos son dos cálculos de combinación separados.",
        "post1Subtitle2": "Cálculo de las probabilidades",
        "post1Text2": "La fórmula para las combinaciones es nCr = n! / (r! * (n-r)!), donde n es el número total de elementos a elegir y r es el número de elementos a elegir.",
        "post1Text3": "Para los números principales: n=50, r=5. Así, 50! / (5! * 45!) = 2.118.760.",
        "post1Text4": "Para los Euro números: n=12, r=2. Así, 12! / (2! * 10!) = 66.",
        "post1Text5": "Para obtener las probabilidades totales de ganar el premio gordo, multiplique las probabilidades de ambos conjuntos de números: 2.118.760 * 66 = 139.838.160. Por lo tanto, las probabilidades de ganar el premio gordo del Eurojackpot son aproximadamente 1 entre 140 millones.",
        "post1Subtitle3": "Qué significa esto?",
        "post1Text6": "Aunque las probabilidades son altas, es importante recordar que las loterías son un juego de azar. Cada boleto tiene la misma oportunidad de ganar. The clave es jugar por diversión y dentro de sus posibilidades. ¡Buena suerte!",
        "navTitle": "Navegación",
        "footer": "&copy; 2026 Eurojackpot Pro. Todos los derechos reservados.",
        "footerDisclaimer": "Por favor, juegue de forma responsable. Debe tener 18 años o más para jugar."
    },
    "fr": {
        "title": "Eurojackpot – Numéros Chanceux du Jour (Statistiques)",
        "subtitle": "Numéros populaires statistiques du jour alimentés par l'IA, mis à jour en permanence pour des informations professionnelles.",
        "cardTitle": "Numéros Suggérés par les Statistiques d'IA",
        "generateDescription": "Notre IA avancée analyse les tirages historiques, les modèles météorologiques et les conditions quotidiennes pour fournir des suggestions de numéros Eurojackpot continuellement mises à jour et statistiquement fondées pour aujourd'hui.",
        "generateStatisticalButton": "Générer des Nombres Statistiques IA",
        "resultTitle": "Vos numéros porte-bonheur",
        "resultSubtitle": "Voici vos numéros générés.",
        "backButton": "Retour au générateur",
        "howItWorksTitle": "Comment ça marche",
        "step1": "Analyser les tirages historiques et les conditions",
        "step2": "L'algorithme d'IA suggère des numéros",
        "step3": "Découvrez vos numéros statistiquement optimisés !",
        "navHome": "Accueil",
        "navGenerator": "Générateur",
        "navBlog": "Blog",
        "navInfo": "Informations",
        "navAbout": "À propos de nous",
        "navContact": "Contact",
        "welcomeTitle": "Bienvenue sur Eurojackpot Pro",
        "welcomeText": "Votre destination unique pour tout ce qui concerne la loterie Eurojackpot. Que vous recherchiez les derniers résultats, un outil pour générer vos numéros porte-bonheur ou des articles approfondis sur les stratégies de loterie, nous avons ce qu'il vous faut.",
        "featuredTitle": "Articles en vedette",
        "post1Title": "Comprendre les probabilités : Une analyse approfondie",
        "post1Summary": "Vous êtes-vous déjà demandé quelles sont vos chances réelles de gagner à l'Eurojackpot ? Dans cet article, nous décomposons les mathématiques behind the odds in a simple, easy-to-understand way.",
        "readMore": "Lire la suite",
        "aboutTitle": "À propos d'Eurojackpot Pro - Statistiques IA",
        "aboutText1": "Bienvenue sur Eurojackpot Pro, votre source de pointe pour des informations sur les numéros Eurojackpot. Nous exploitons une IA avancée et des données historiques complètes pour vous proposer des numéros suggérés statistiquement, améliorant ainsi votre expérience de loterie avec des choix éclairés.",
        "aboutText2": "Fondé en 2026, Eurojackpot Pro a évolué d'une passion pour l'analyse axée sur les données vers une plateforme sophistiquée pour les amateurs de loterie. Notre méthodologie s'adapte continuellement, traitant de vastes ensembles de données, y compris les tirages passés, les modèles météorologiques et les facteurs environnementaux pour affiner nos suggestions. Nous nous engageons à donner aux joueurs de toute l'Europe des informations innovantes et basées sur des données.",
        "aboutText3": "Nous espérons que vous apprécierez nos produits autant que nous aimons vous les offrir. Si vous avez des questions ou des commentaires, n'hésitez pas à nous contacter.",
        "contactTitle": "Contactez-nous",
        "contactText": "Vous avez une question ou des commentaires ? Remplissez le formulaire ci-dessous et nous vous répondrons dès que possible.",
        "navPrivacy": "Politique de confidentialité",
        "navTerms": "Conditions d'utilisation",
        "formName": "Nom",
        "formEmail": "E-mail",
        "formMessage": "Message",
        "formSubmit": "Envoyer le message",
        "blogTitle": "Blog de la loterie",
        "post1Intro": "Le rêve de gagner à la loterie est universel, mais quelles sont les probabilités mathématiques réelles de décrocher le jackpot Eurojackpot ? Dans cet article, nous explorerons les chiffres behind the game to give you a clearer picture of your chances.",
        "post1Subtitle1": "Les bases des combinaisons",
        "post1Text1": "Pour comprendre les probabilités de la loterie, nous devons d'abord comprendre le concept de combinaisons. En mathématiques, une combinaison est une sélection d'éléments d'une collection, de telle sorte que l'ordre de sélection n'a pas d'importance. Pour Eurojackpot, vous choisissez 5 numéros sur 50 et 2 numéros sur 12. Ces sont deux calculs de combinaison distincts.",
        "post1Subtitle2": "Calcul des probabilités",
        "post1Text2": "La formule des combinaisons est nCr = n! / (r! * (n-r)!), où n est le nombre total d'éléments à choisir et r est le nombre d'éléments à choisir.",
        "post1Text3": "Pour les numéros principaux : n=50, r=5. Donc, 50! / (5! * 45!) = 2 118 760.",
        "post1Text4": "Pour les Euro numéros : n=12, r=2. Donc, 12! / (2! * 10!) = 66.",
        "post1Text5": "Pour obtenir les probabilités totales de gagner le jackpot, multipliez les probabilités des deux ensembles de numéros : 2 118 760 * 66 = 139 838 160. Ainsi, les probabilités de gagner le jackpot Eurojackpot sont d'environ 1 sur 140 millions.",
        "post1Subtitle3": "Qu'est-ce que cela signifie ?",
        "post1Text6": "Bien que les probabilités soient élevées, il est important de se rappeler que les loteries sont un jeu de hasard. Chaque billet a une chance égale de gagner. La clé est de jouer pour le plaisir et dans la limite de vos moyens. Bonne chance !"
    }
}